/*******************************************************************
**Description: Copyright(c) 2018-2025 LiHeBio,All rights reserved.
**Author: DengXiaoJun
**Date: 2020-02-11 13:54:56
**LastEditors: DengXiaoJun
**LastEditTime: 2020-12-17 09:54:01
**FilePath: \H360_ActionBoard_ID_2\TaskMain\AppSupport\AppUtil\AppParamDefault.c
**ModifyRecord1:    
**ModifyRecord2:    
**ModifyRecord3:    
**ModifyRecord4:    
**ModifyRecord5:    
******************************************************************/
#include "AppParamDefault.h"

//磁珠针默认参数
const APP_PARAM_NEEDLE_BEAD appParamNeedleBeadDefaultSetting = {
    -312,//磁珠针旋转零位修正
    0,//磁珠针升降零位修正
    -312,//磁珠针旋转到清洗位坐标
    1080,//磁珠针升降到清洗位坐标
    1000,//磁珠针清洗时间1,长内外针,毫秒
    1000,//磁珠针清洗时间2,短外针,毫秒
    1000,//磁珠针清洗时间3,毫秒
    1000,//磁珠针清洗时间4,毫秒
    1000,//磁珠针清洗时间5,毫秒
    5000,//磁珠针清洗液灌注时间,毫秒
    -660,//磁珠针旋转到R1坐标
    900,//磁珠针升降R1吸样探液起始点
    3110,//磁珠针升降R1吸样探液极限点
    -804,//磁珠针旋转到R2坐标
    900,//磁珠针升降R2吸样探液起始点
    3110,//磁珠针升降R2吸样探液极限点
    -1074,//磁珠针旋转到磁珠位坐标
    900,//磁珠针升降磁珠位吸样探液起始点
    2080,//磁珠针升降磁珠位吸样探液极限点
    289,//磁珠针旋转到反应盘排样坐标
    1420,//磁珠针升降反应盘排样高度1,最浅
    1420,//磁珠针升降反应盘排样高度2
    1420,//磁珠针升降反应盘排样高度3
    1420,//磁珠针升降反应盘排样高度4
    1420,//磁珠针升降反应盘排样高度5
    1420,//磁珠针升降反应盘排样高度6
    1420,//磁珠针升降反应盘排样高度7
    1420,//磁珠针升降反应盘排样高度8,最深
    20,//磁珠针清洗完吸空气量
    30,//磁珠针吸样完吸空气量
    25,//磁珠针注液保留空气量
    1,//磁珠针探液通讯使能
    0,//磁珠针泵齿间差
    0,//小磁珠吸吐混匀高度
    0,//探液板未更新
    {0},//保留参数
};

//试剂盘默认参数
const APP_PARAM_PLATE_REAGENT appParamPlateReagentDefaultSetting = {
    8035,//试剂盘零位修正
    0,//试剂盘控制版本号
    0,//试剂盘相对试剂针到R1偏移
    1685,//试剂盘相对试剂针到R2偏移
    -1480,//试剂盘相对磁珠针到R1偏移
    -1860,//试剂盘相对磁珠针到R2偏移
    -3200,//试剂盘相对磁珠针到磁珠偏移
    6935,//试剂盘到扫码位偏移
    0,//试剂盘到RFID位偏移
    {0},//保留参数
};


//杯栈管理参数
const APP_PARAM_CUP_TRAY_STACK_MANAGE appParamCupTrayStackManageDefaultSetting = {
    0,//新杯盘升降电机零位修正
    0,//空杯盘升降电机零位修正
    -45,//夹手电机零位修正
    -200,//推杆电机零位修正
    -260,//夹手打开坐标
    60,//夹手关闭坐标
    5200,//推杆推新盘到测试位坐标
    15,//推杆二次推进补充偏移
    1750,//新杯栈满时,顶部到检测位偏移
    3300,//新杯栈满时,顶部到平台偏移
    1056,//新杯栈上升一个杯盘的偏移
    0,//空杯栈满时,顶部到检测位偏移
    1650,//空杯栈满时,顶部到承接平台偏移
    1056,//空杯栈上升一个杯盘的偏移
    {0},//保留参数
};

//辅助参数
const APP_PARAM_OTHER appParamOtherDefaultSetting = {
  0,//辅助参数
  {0},//保留参数
};








