/*******************************************************************
**Description: Copyright(c) 2018-2025 LiHeBio,All rights reserved.
**Author: DengXiaoJun
**Date: 2020-01-17 10:02:55
**LastEditors: DengXiaoJun
**LastEditTime: 2020-01-19 19:31:35
**FilePath: \LH_TC_APP_V2.3\TaskMain\ServiceSupport\ServiceUtil\ServiceUtilParamDefault.c
**ModifyRecord1:    
**ModifyRecord2:    
**ModifyRecord3:    
**ModifyRecord4:    
**ModifyRecord5:    
******************************************************************/
#include "ServiceUtilParamDefault.h"

const SERVICE_PARAM_CONFIG serviceParamConfig = {
    ENABLE,//是否使能反应盘控温
    ENABLE,//是否使能清洗盘控温
    ENABLE,//是否使能试剂盘控温
    DISABLE,//是否使能环境温度检测与相关控制

    DISABLE,//是否使能反应盘电流检测
    0,      //反应盘电流检测下限值
    3300,   //反应盘电流检测上限值
    
    DISABLE,//是否使能清洗盘电流检测
    0,      //清洗盘电流检测下限值
    3300,   //清洗盘电流检测上限值
    
    DISABLE,//是否使能试剂盘电流检测1
    0,      //试剂盘电流检测1电流检测下限值
    3300,   //试剂盘电流检测1电流检测上限值

    DISABLE,//是否使能试剂盘电流检测2
    0,      //试剂盘电流检测2电流检测下限值
    3300,   //试剂盘电流检测2电流检测上限值
    
    DISABLE,//是否使能试剂盘电流检测3
    0,      //试剂盘电流检测3电流检测下限值
    3300,   //试剂盘电流检测3电流检测上限值

    DISABLE,//是否使能试剂盘电流检测4
    0,      //试剂盘电流检测4电流检测下限值
    3300,   //试剂盘电流检测4电流检测上限值
    
    {0},    //保留参数
};


const SERVICE_PARAM_USER serviceParamUserDeafult = {
    SYSTEM_CONFIG_FLAG,
    //反应盘
    37.5,       //目标温度
    0.5,        //PID控温参数 比例
    0.1,        //PID控温参数 积分
    0.00,       //PID控温参数 微分
    38.5,       //温度上限阈值,超过该数据,最大功率降温
    36.5,       //温度下限阈值,低于该数据,最大功率升温
    0.9999,     //输出最大功率
    0.0001,     //输出最小功率
    70,         //保护温度上限,高于该温度不控温,报警
    -20.0,      //保护温度下限,低于该温度不控温,报警
    5,          //积分时间设定
    5,          //微分时间设定
    {0},        //预留空间
    //清洗盘
    37.5,       //目标温度
    0.5,        //PID控温参数 比例
    0.1,        //PID控温参数 积分
    0.00,       //PID控温参数 微分
    38.5,       //温度上限阈值,超过该数据,最大功率降温
    36.5,       //温度下限阈值,低于该数据,最大功率升温
    0.9999,     //输出最大功率
    0.0001,     //输出最小功率
    70,         //保护温度上限,高于该温度不控温,报警
    -20.0,      //保护温度下限,低于该温度不控温,报警
    5,          //积分时间设定
    5,          //微分时间设定
    {0},        //预留空间
    //试剂盘
    6.0,       //目标温度
    0.9999,    //输出最大功率
    0.0001,    //输出最小功率
    60,        //保护温度上限
    -20.0,     //保护温度下限
    0,         //试剂盘温控控制类型
    {0},       //预留空间
    //环境温度
    60.0,       //环境温度上限温度
    -20.0,      //环境温度下限温度
    20,         //打开风扇的温度
    {0},        //预留空间
    //板上温度
    60.0,       //板上温度上限
    -20.0,      //板上温度下限
    {0},        //预留空间
};





















