/*******************************************************************
**Description: Copyright(c) 2018-2025 LiHeBio,All rights reserved.
**Author: DengXiaoJun
**Date: 2020-02-11 13:55:22
**LastEditors: DengXiaoJun
**LastEditTime: 2020-07-29 13:13:44
**FilePath: \H360_ActionBoard_ID_4\TaskMain\AppSupport\AppUtil\AppParamDefault.c
**ModifyRecord1:    
**ModifyRecord2:    
**ModifyRecord3:    
**ModifyRecord4:    
**ModifyRecord5:    
******************************************************************/
#include "AppParamDefault.h"

//试剂摇匀参数
const APP_PARAM_MIX_REAGENT appParamMixReagentDefaultSetting = {
  0,//试剂摇匀升降零位修正
  0,//试剂摇匀旋转零位修正
  1900,//试剂摇匀模式1升降高度
  3600,//试剂摇匀模式1摇匀时间,毫秒
  1900,//试剂摇匀模式2升降高度
  3600,//试剂摇匀模式2摇匀时间,毫秒
  1900,//试剂摇匀模式2升降高度
  3600,//试剂摇匀模式3摇匀时间,毫秒
  1900,//试剂摇匀模式2升降高度
  3600,//试剂摇匀模式4摇匀时间,毫秒
  1900,//试剂摇匀模式2升降高度
  3600,//试剂摇匀模式5摇匀时间,毫秒
  1900,//试剂摇匀模式2升降高度
  3600,//试剂摇匀模式6摇匀时间,毫秒
  1900,//试剂摇匀模式2升降高度
  3600,//试剂摇匀模式7摇匀时间,毫秒
  1900,//试剂摇匀模式2升降高度
  3600,//试剂摇匀模式8摇匀时间,毫秒
  1900,//试剂摇匀模式2升降高度
  3600,//试剂摇匀模式9摇匀时间,毫秒
  1900,//试剂摇匀模式2升降高度
  3600,//试剂摇匀模式10摇匀时间,毫秒
  0,   //试剂摇匀电机配置0有原点,1无原点
  {0},//保留参数
};

//试剂针参数
const APP_PARAM_NEEDLE_REAGENT appParamNeedleReagentDefaultSetting = {
  330,//试剂针旋转零位修正
  0,//试剂针升降零位修正
  330,//试剂针旋转到清洗位坐标
  1100,//试剂针升降到清洗位坐标
  1000,//试剂针清洗时间1,长内外针,毫秒
  1000,//试剂针清洗时间2,短外针,毫秒
  1000,//试剂针清洗时间3,毫秒
  1000,//试剂针清洗时间4,毫秒
  1000,//试剂针清洗时间5,毫秒
  5000,//试剂针清洗液灌注时间,毫秒
  810,//试剂针旋转到R1坐标
  750,//试剂针升降R1吸样探液起始点
  3020,//试剂针升降R1吸样探液极限点
  1299,//试剂针旋转到R2坐标
  750,//试剂针升降R2吸样探液起始点
  3030,//试剂针升降R2吸样探液极限点
  -210,//试剂针旋转到反应盘排样坐标
  1500,//试剂针升降反应盘排样高度1,最浅
  1500,//试剂针升降反应盘排样高度2
  1500,//试剂针升降反应盘排样高度3
  1500,//试剂针升降反应盘排样高度4
  1500,//试剂针升降反应盘排样高度5
  1500,//试剂针升降反应盘排样高度6
  1500,//试剂针升降反应盘排样高度7
  1500,//试剂针升降反应盘排样高度8,最深
  20,//试剂针清洗完吸空气量
  20,//试剂针吸样完吸空气量
  20,//试剂针注液保留空气量
  1,//试剂针探液通讯使能
  0,//试剂针齿间差
  0,//探液板未更新
  {0},//保留参数
};

//磁珠摇匀参数
const APP_PARAM_MIX_BEAD appParamMixBeadDefaultSetting = {
  -100,//磁珠摇匀升降零位修正
  0,//磁珠摇匀旋转零位修正
  1830,//磁珠摇匀模式1升降高度
  3600,//磁珠摇匀模式1摇匀时间,毫秒
  1830,//磁珠摇匀模式2升降高度
  3600,//磁珠摇匀模式2摇匀时间,毫秒
  1830,//磁珠摇匀模式2升降高度
  3600,//磁珠摇匀模式3摇匀时间,毫秒
  1830,//磁珠摇匀模式2升降高度
  3600,//磁珠摇匀模式4摇匀时间,毫秒
  1830,//磁珠摇匀模式2升降高度
  3600,//磁珠摇匀模式5摇匀时间,毫秒
  1830,//磁珠摇匀模式2升降高度
  3600,//磁珠摇匀模式6摇匀时间,毫秒
  1830,//磁珠摇匀模式2升降高度
  3600,//磁珠摇匀模式7摇匀时间,毫秒
  1830,//磁珠摇匀模式2升降高度
  3600,//磁珠摇匀模式8摇匀时间,毫秒
  1830,//磁珠摇匀模式2升降高度
  3600,//磁珠摇匀模式9摇匀时间,毫秒
  1830,//磁珠摇匀模式2升降高度
  3600,//磁珠摇匀模式10摇匀时间,毫秒
  0,   //磁珠摇匀电机配置0有原点,1无原点
  {0},//保留参数  
};

//反应盘
const APP_PARAM_PLATE_REACTION appParamPlateReactionDefaultSetting = {
  -30,//旋转零位修正
  {0},//保留参数  
};

//其余支持
const APP_PARAM_OTHER appParamOtherDefaultSetting = {
  0,//辅助参数
  {0},//保留参数  
};










